---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStairsPathFailure
source: html/0ba0230f-2e16-da2b-0064-8830591761a8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStairsPathFailure Property

Invalid stairs path provided.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidStairsPathFailure { get; }
```